SET NOCOUNT ON

SELECT 
	ОстаткиТовара.ФирмаIDD AS ФирмаIDD,
	ОстаткиТовара.СкладIDD AS СкладIDD,
	ПодразделенияТорговли.IDD AS ПодразделенияIDD,
	SUBSTRING(master.dbo.fn_varbintohexstr(HashBytes('MD5', ОстаткиТовара.ФирмаIDD+ОстаткиТовара.СкладIDD)), 18, 32) AS ХешСкладаIDD,  
	SUBSTRING(master.dbo.fn_varbintohexstr(HashBytes('MD5', ОстаткиТовара.ФирмаIDD+ПодразделенияТорговли.IDD)), 18, 32) AS ХешПодразделенияIDD,
	ОстаткиТовара.ТоварIDD AS ТоварIDD,
	ОстаткиТовара.Стоимость AS Себестоимость,
	ОстаткиТовара.ОстатокТовара AS ОстатокКоличество
FROM 
	dbo.Бух_РегистрОстатки_ПартииТоваров AS ОстаткиТовара
		LEFT JOIN Бух_Справочник_МестаХранения AS МестаХранения 
			ON (МестаХранения.id =ОстаткиТовара.СкладID)
			LEFT JOIN Бух_Справочник_Подразделения AS ПодразделенияТорговли
				ON МестаХранения.ВладелецID = ПодразделенияТорговли.ID
WHERE
	ОстаткиТовара.period = '20180101'
	AND ОстаткиТовара.ФирмаIDD = '10015480660352695' -- ИП Моисеев М.Д.
	AND ОстаткиТовара.ТоварIDD IS NOT NULL
	AND (ОстаткиТовара.ОстатокТовара > 0
		AND ОстаткиТовара.Стоимость > 0
	)