USE RIASSE


SET NOCOUNT ON

DECLARE @Today datetime
SET @Today = '20200207'
DECLARE @DateStart datetime
SET @DateStart = '20200101'
DECLARE @DateFinal datetime
SET @DateFinal = '20200331'

DECLARE @ТипРаскраскиСтараяIDD char(17)
SET @ТипРаскраскиСтараяIDD = '10015480867933597'
DECLARE @ТипРаскраскиЭльситиIDD char(17)
SET @ТипРаскраскиЭльситиIDD = '10015480867933684'
DECLARE @ТипРаскраскиКомандорIDD char(17)
SET @ТипРаскраскиКомандорIDD = '10015480867933617'

DECLARE @ЭльситиАкцияКаталог char(9)
SET @ЭльситиАкцияКаталог = '     A   '
DECLARE @ЭльситиАкцияЖелтыйЦенник char(9)
SET @ЭльситиАкцияЖелтыйЦенник = '     9   '

DECLARE @ЭльситиКаталогНачало numeric(8,0)
SET @ЭльситиКаталогНачало = 8421631
DECLARE @ЭльситиКаталогКонец numeric(8,0)
SET @ЭльситиКаталогКонец = 183
	
DECLARE @ЭльситиЖелтыйЦенникНачало numeric(8,0)
SET @ЭльситиЖелтыйЦенникНачало = 13303807
DECLARE @ЭльситиЖелтыйЦенникКонец numeric(8,0)
SET @ЭльситиЖелтыйЦенникКонец = 52942

DECLARE @КомандорСпецЦенаПоКопилкеНачало numeric(8,0)
SET @КомандорСпецЦенаПоКопилкеНачало = 16763025
DECLARE @КомандорСпецЦенаПоКопилкеКонец numeric(8,0)
SET @КомандорСпецЦенаПоКопилкеКонец = 16711680


DECLARE @СтарыйТовар varchar(9)
SET @СтарыйТовар = '   9JL   '

;
WITH ColorColumnTables (ТоварIDD, ТипыРаскрасокТоваровIDD, ТипМагазина, Приоритет, Цвет) AS (	
SELECT  
	Справочник_Номенклатура.sp6353 AS ТоварIDD
	,@ТипРаскраскиСтараяIDD AS ТипыРаскрасокТоваровIDD
	,'ИзРеквизитаНоменклатуры' AS ТипМагазина
	,9 AS Приоритет
	,CASE 
		WHEN DATEDIFF(day, @Today, Справочник_Номенклатура.sp7585) >= -30
			AND DATEDIFF(day, @Today, Справочник_Номенклатура.sp7585) <= 0 THEN
				65280
		WHEN Справочник_Номенклатура.sp3755 = @СтарыйТовар 
			AND DATEDIFF(day, @Today, Справочник_Номенклатура.sp7585) <= -30 THEN
				12632256
		ELSE 
			ISNULL(Справочник_РаскраскаТоваров.sp10772, 0)
	END AS Цвет

FROM 
	sc33 AS Справочник_Номенклатура WITH (NOLOCK)
	LEFT JOIN sc10777 AS Справочник_РаскраскаТоваров WITH (NOLOCK) 
		ON 'E1'+' 7RJ'+Справочник_Номенклатура.sp3755 = Справочник_РаскраскаТоваров.sp10770
WHERE
	Справочник_Номенклатура.ISMARK = 0
	AND Справочник_Номенклатура.ISFOLDER = 2
	AND ((DATEDIFF(day, @Today, Справочник_Номенклатура.sp7585) >= -30
			AND DATEDIFF(day, @Today, Справочник_Номенклатура.sp7585) <= 0)
		 OR (Справочник_Номенклатура.sp3755 = @СтарыйТовар 
			AND DATEDIFF(day, @Today, Справочник_Номенклатура.sp7585) <= -30))

UNION

SELECT DISTINCT
	Справочник_Номенклатура.sp6353 AS ТоварIDD
	,'10015480867933617' AS ТипыРаскрасокТоваровIDD
	,'Командор' AS ТипМагазина
	,4 AS Приоритет
	,16744576 AS Цвет 
FROM 
	sc11770 AS Справочник_ЦелевыеГруппы WITH (NOLOCK)
	INNER JOIN sc12073 AS Справочник_ТоварыГруппКопилки WITH (NOLOCK)
		ON Справочник_ЦелевыеГруппы.ID = Справочник_ТоварыГруппКопилки.PARENTEXT
	INNER JOIN sc33 AS Справочник_Номенклатура WITH (NOLOCK)
		ON	Справочник_ТоварыГруппКопилки.sp12069 = Справочник_Номенклатура.ID
WHERE 
	1 = 1
	AND Справочник_ЦелевыеГруппы.DESCR LIKE '10из100'
	AND Справочник_ЦелевыеГруппы.sp12065 <= @Today 
	AND Справочник_ЦелевыеГруппы.sp12066 >= @Today 

UNION

SELECT DISTINCT
	Справочник_Номенклатура.sp6353 AS ТоварIDD
	,'10015480867933617' AS ТипыРаскрасокТоваровIDD
	,'Командор' AS ТипМагазина
	,5 AS Приоритет
	,16776960 AS Цвет  
FROM 
	sc12394 AS Справочник_АкцияОграниченияПоКопилке WITH (NOLOCK)
	INNER JOIN sc33 AS Справочник_Номенклатура WITH (NOLOCK)
		ON	Справочник_АкцияОграниченияПоКопилке.sp12387 = Справочник_Номенклатура.ID
WHERE
	1=1
	AND @Today >= Справочник_АкцияОграниченияПоКопилке.sp12389
	AND @Today <= Справочник_АкцияОграниченияПоКопилке.sp12390

UNION

SELECT DISTINCT
	Справочник_Номенклатура.sp6353 AS ТоварIDD
	,@ТипРаскраскиЭльситиIDD AS ТипыРаскрасокТоваровIDD
	,'Эльсити' AS ТипМагазина
	,(CASE
		WHEN @Today >= Справочник_Действия.sp12659 AND @Today <= Справочник_Действия.sp12660
			THEN 2
		WHEN @Today < Справочник_Действия.sp12659
			THEN 2 * 20
		WHEN @Today > Справочник_Действия.sp12660
			THEN 2 * 30
	END) AS Приоритет
	,(CASE
		WHEN @Today >= Справочник_Действия.sp12659 AND @Today <= Справочник_Действия.sp12660
			THEN Справочник_АкцииДляКассы.sp12833 
		WHEN DATEADD(DAY, 14, @Today) >= Справочник_Действия.sp12659 AND @Today < Справочник_Действия.sp12659
			AND Справочник_Действия.sp10727 IN ('     A   ','     I   ' )
				THEN @ЭльситиКаталогНачало
		WHEN @Today > Справочник_Действия.sp12660 AND DATEADD(DAY, -14, @Today) <= Справочник_Действия.sp12660
			AND Справочник_Действия.sp10727 IN ('     A   ','     I   ' )
				THEN @ЭльситиКаталогКонец
		WHEN DATEADD(DAY, 7, @Today) >= Справочник_Действия.sp12659 AND @Today < Справочник_Действия.sp12659
			AND Справочник_Действия.sp10727 = @ЭльситиАкцияЖелтыйЦенник
				THEN @ЭльситиЖелтыйЦенникНачало
		WHEN @Today > Справочник_Действия.sp12660 AND DATEADD(DAY, -7, @Today) <= Справочник_Действия.sp12660
			AND Справочник_Действия.sp10727 = @ЭльситиАкцияЖелтыйЦенник
				THEN @ЭльситиЖелтыйЦенникКонец
		ELSE
		0
	END) AS Цвет	

FROM 
	sc7440 AS Справочник_Действия WITH (NOLOCK)
	JOIN sc33 AS Справочник_Номенклатура WITH (NOLOCK)
		ON Справочник_Действия.sp7434 = Справочник_Номенклатура.ID
	JOIN sc12665 AS Справочник_АкцииДляКассы WITH (NOLOCK)
		ON Справочник_Действия.sp10727 = Справочник_АкцииДляКассы.ID
WHERE
	Справочник_Действия.sp12659 < Справочник_Действия.sp12660
	AND Справочник_Действия.sp10727 IN ('     0   ','     0   ','     9   ','     2   ','     3   ','     1   ','     A   ','     B   ','     0   ','     0   ','     I   ','     D   ' )

UNION

SELECT DISTINCT
	Справочник_Номенклатура.sp6353 AS ТоварIDD
	,'10015480867933617' AS ТипыРаскрасокТоваровIDD
	,'Командор' AS ТипМагазина
	,(CASE
		WHEN @Today >= Справочник_Действия.sp12659 AND @Today <= Справочник_Действия.sp12660
			THEN 3
		WHEN @Today < Справочник_Действия.sp12659
			THEN 3 * 20
		WHEN @Today > Справочник_Действия.sp12660
			THEN 3 * 30
	END) AS Приоритет
	,(CASE
		WHEN @Today >= Справочник_Действия.sp12659 AND @Today <= Справочник_Действия.sp12660 THEN
			Справочник_АкцииДляКассы.sp12833
		WHEN DATEADD(DAY, 14, @Today) >= Справочник_Действия.sp12659 AND @Today < Справочник_Действия.sp12659
			AND Справочник_Действия.sp10727 IN ('     6   ' )
				THEN @КомандорСпецЦенаПоКопилкеНачало
		WHEN @Today > Справочник_Действия.sp12660 AND DATEADD(DAY, -14, @Today) <= Справочник_Действия.sp12660
			AND Справочник_Действия.sp10727 IN ('     6   ' )
				THEN @КомандорСпецЦенаПоКопилкеКонец
		ELSE
		0
	END) AS Цвет

FROM 
	sc7440 AS Справочник_Действия WITH (NOLOCK)
	JOIN sc33 AS Справочник_Номенклатура WITH (NOLOCK)
		ON Справочник_Действия.sp7434 = Справочник_Номенклатура.ID
	JOIN sc12665 AS Справочник_АкцииДляКассы WITH (NOLOCK)
		ON Справочник_Действия.sp10727 = Справочник_АкцииДляКассы.ID
WHERE
	Справочник_Действия.sp12659 < Справочник_Действия.sp12660
	AND Справочник_Действия.sp10727 IN ('     6   ','     0   ','     0   ','     0   ','     9   ','     0   ','     0   ','     0   ','     2   ','     H   ' )
) 

SELECT DISTINCT
	Справочник_Номенклатура.Код
	,TempTable_1.ТоварIDD AS ТоварIDD 
	,TempTable_1.ТипыРаскрасокТоваровIDD AS ТипыРаскрасокТоваровIDD
	,TempTable_1.ТипМагазина AS ТипМагазина
	,TempTable_1.Приоритет AS Приоритет
	,TempTable_1.Цвет AS Цвет 
	
FROM
	ColorColumnTables AS TempTable_1
	LEFT JOIN dbo.Бух_Справочник_Номенклатура AS Справочник_Номенклатура
		ON TempTable_1.ТоварIDD = Справочник_Номенклатура.IDD
WHERE 
	--Цвет <> 0
	--Цвет = 183
	and Справочник_Номенклатура.Код IN ('547099')
	--AND Цвет = 128

ORDER BY
	ТипМагазина
	,Код
	,Приоритет