USE RIASSE
SET NOCOUNT ON
		
SELECT  
	CASE LEFT(ДокументСтроки_РозничнаяВыручка.ДокID13, 4)
		WHEN '  C2' THEN 'Возврат'
		ELSE 'Продажи'
	END AS ВидОперации,
	LTRIM(RTRIM(ДокументСтроки_РозничнаяВыручка.ВидОплаты)) AS ВидОплаты,
	LTRIM(RTRIM(ДокументСтроки_РозничнаяВыручка.ВидОтгрузки)) AS ВидОтгрузки,
	SUM(ДокументСтроки_РозничнаяВыручка.Сумма) AS Сумма

FROM 
   dbo.Бух_ДокументСтроки_РозничнаяВыручка AS ДокументСтроки_РозничнаяВыручка

WHERE
	ДокументСтроки_РозничнаяВыручка.iddoc = ' 6Y7OS   ' 
	
GROUP BY
	CASE LEFT(ДокументСтроки_РозничнаяВыручка.ДокID13, 4)
		WHEN '  C2' THEN 'Возврат'
		ELSE 'Продажи'
	END,
	ВидОплаты,
	ВидОтгрузки
ORDER BY
	ВидОтгрузки