USE RIASSE

SET NOCOUNT ON
		
SELECT  
	LTRIM(RTRIM(ДокументСтроки_РозничнаяВыручка.ВидОплаты)) AS ВидОплаты,
	LTRIM(RTRIM(ДокументСтроки_РозничнаяВыручка.ВидОтгрузки)) AS ВидОтгрузки,
	SUM(ДокументСтроки_РозничнаяВыручка.Сумма) AS Сумма
FROM 
	dbo.Бух_Документ_РозничнаяВыручка AS РозничнаяВыручка 
	LEFT JOIN dbo.Бух_ДокументСтроки_РозничнаяВыручка AS ДокументСтроки_РозничнаяВыручка
		ON РозничнаяВыручка.iddoc = ДокументСтроки_РозничнаяВыручка.iddoc 
WHERE
	РозничнаяВыручка.date_time_iddoc >= '20180114'
	AND РозничнаяВыручка.date_time_iddoc <= '20180114z'
	AND РозничнаяВыручка.closed &1=1
	AND РозничнаяВыручка.СуммаВсего <> 0
	AND РозничнаяВыручка.ФирмаIDD = '10015480660352695'
	AND РозничнаяВыручка.СкладIDD = '10015480000037933'
GROUP BY
	ВидОплаты,
	ВидОтгрузки
ORDER BY
	ВидОтгрузки