USE RIASSE

SELECT
	'—чет‘актура полученный' AS “ипƒокументов,
	–егистраци€—чета_фактуры.‘ирмаIDD AS ‘ирмаIDD,
	–егистраци€—чета_фактуры.Ќомер—чета‘актуры AS IDD,
	–егистраци€—чета_фактуры.Ќомерƒок AS Ќомерƒок, 
	–егистраци€—чета_фактуры.ƒатаƒок AS ƒатаƒок, 
	CAST(–егистраци€—чета_фактуры.closed AS INT) AS closed,
	CAST(–егистраци€—чета_фактуры.ismark AS INT) AS ismark,
	CASE 
	WHEN CAST(–егистраци€—чета_фактуры.closed AS INT) = 0
	AND CAST(–егистраци€—чета_фактуры.ismark AS INT) = 0 
	THEN CAST(1 AS INT) 
	ELSE CAST(0 AS INT)  
	END AS OnlySaved,
	–егистраци€—чета_фактуры.—умма AS —уммаƒокумента,
	–егистраци€—чета_фактуры. омментарий AS  омментарий
FROM 
	dbo.Ѕух_ƒокумент_–егистраци€—чета_фактуры AS –егистраци€—чета_фактуры
WHERE
	–егистраци€—чета_фактуры.CLOSED &1=1
	AND –егистраци€—чета_фактуры.date_time_iddoc >= '20190101'
	AND –егистраци€—чета_фактуры.date_time_iddoc <= '20191231z'
	AND –егистраци€—чета_фактуры.‘ирмаIDD IN ('10015480544879301')

UNION ALL

SELECT
	'—чет‘актура полученный' AS “ипƒокументов,
	 орректировочный—чет‘актураѕолученный.‘ирмаIDD AS ‘ирмаIDD,
	 орректировочный—чет‘актураѕолученный.Ќомерƒок¬ход€щий AS IDD,
	 орректировочный—чет‘актураѕолученный.Ќомерƒок AS Ќомерƒок, 
	 орректировочный—чет‘актураѕолученный.ƒатаƒок AS ƒатаƒок, 
	CAST( орректировочный—чет‘актураѕолученный.closed AS INT) AS closed,
	CAST( орректировочный—чет‘актураѕолученный.ismark AS INT) AS ismark,
	CASE 
	WHEN CAST( орректировочный—чет‘актураѕолученный.closed AS INT) = 0
	AND CAST( орректировочный—чет‘актураѕолученный.ismark AS INT) = 0 
	THEN CAST(1 AS INT) 
	ELSE CAST(0 AS INT)  
	END AS OnlySaved,
	 орректировочный—чет‘актураѕолученный.—уммаЅезЌƒ—20 AS —уммаƒокумента,
	 орректировочный—чет‘актураѕолученный. омментарий AS  омментарий
FROM 
	dbo.Ѕух_ƒокумент_ орректировочный—чет‘актураѕолученный AS  орректировочный—чет‘актураѕолученный
WHERE
	 орректировочный—чет‘актураѕолученный.CLOSED &1=1
	AND  орректировочный—чет‘актураѕолученный.date_time_iddoc >= '20190101'
	AND  орректировочный—чет‘актураѕолученный.date_time_iddoc <= '20190131z'
	AND  орректировочный—чет‘актураѕолученный.‘ирмаIDD IN ('10015480544879301') 