SELECT DISTINCT
	ПриходнаяНакладная_Строки.ТоварIDD
INTO #Material
FROM
	Бух_ДокументСтроки_ПриходнаяНакладная AS ПриходнаяНакладная_Строки
WHERE
	ПриходнаяНакладная_Строки.iddoc IN (
SELECT
	ПриходнаяНакладная.iddoc
FROM
	Бух_Документ_ПриходнаяНакладная AS ПриходнаяНакладная
WHERE
	ПриходнаяНакладная.CLOSED = 1
	AND ПриходнаяНакладная.date_time_iddoc >= '20170101'
	AND ПриходнаяНакладная.date_time_iddoc <= '20171231z'
	AND ПриходнаяНакладная.ВидПоступленияТабл = '1'
)

SELECT DISTINCT
	РегистрОстатки_ПартииТоваров.ТоварIDD AS ТоварИДД
FROM
	dbo.Бух_РегистрОстатки_ПартииТоваров AS РегистрОстатки_ПартииТоваров
WHERE
	РегистрОстатки_ПартииТоваров.ТоварIDD IN (
		SELECT
	Материалы.ТоварIDD
FROM #Material AS Материалы)

DROP TABLE #Material